{"backend": "tensorflow", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "batch_input_shape": [null, 50, 15, 3], "data_format": "channels_last", "trainable": true, "dtype": "float32", "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "activation": "relu", "filters": 64, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_2", "activation": "relu", "filters": 64, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [2, 2], "bias_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_3", "activation": "relu", "filters": 128, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_4", "activation": "relu", "filters": 128, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_5", "activation": "relu", "filters": 256, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "trainable": true, "dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_6", "activation": "relu", "filters": 256, "kernel_constraint": null, "bias_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "units": 2048, "name": "dense_1", "activation": "relu", "kernel_constraint": {"config": {"axis": 0, "max_value": 3}, "class_name": "MaxNorm"}, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "units": 1024, "name": "dense_2", "activation": "relu", "kernel_constraint": {"config": {"axis": 0, "max_value": 3}, "class_name": "MaxNorm"}, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "units": 53, "name": "dense_3", "activation": "softmax", "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.6"}